app/Http/Controllers/Web/Backend/DashboardController.php

select count(*) as aggregate from `w_games` where (`shop_id` = 1 and `view` = 1)
select * from `w_shops` where `id` in (1) order by `id` desc limit 5
select `w_open_shift`.* from `w_open_shift` where `w_open_shift`.`shop_id` in (1) order by `w_open_shift`.`start_date` desc limit 5
---
        public function index()
        {

            if (\Auth::user()->hasRole('cashier'))
            {
                return redirect()->route('netpos');
            }
            if (!auth()->user()->hasPermission('dashboard'))
            {
                return redirect()->route('backend.user.list');
            }
            $ids = auth()->user()->hierarchyUsers();
            $availableShops = auth()->user()->availableShops();
            $stats = [
                'total' => $this->users->count(null),
                'new' => $this->users->newUsersCount($ids),
                'banned' => $this->users->countByStatus(\VanguardLTE\Support\Enum\UserStatus::BANNED, $ids),
                'games' => \VanguardLTE\Game::where(['shop_id' => auth()->user()->shop_id, 'view' => 1])->count(),
            ];
            $shops = \VanguardLTE\Shop::orderBy('id', 'desc')->whereIn('id', $availableShops)->take(5)->get();
            $open_shift = \VanguardLTE\OpenShift::select('open_shift.*')->whereIn('open_shift.shop_id', $availableShops)->orderBy('open_shift.start_date', 'DESC')->take(5)->get();

select * from `w_stat_game` where `user_id` in (1, 2) order by `date_time` desc limit 5
---
                $statistics = $statistics->whereIn('user_id', $ids);
            }
            $statistics = $statistics->orderBy('id', 'DESC')->take(5)->get();
            $gamestat = \VanguardLTE\StatGame::whereIn('user_id', $ids)->orderBy('date_time', 'DESC')->take(5)->get();