app/Http/Controllers/Web/Backend/ShopsController.php

                    $shops = $shops->where('shops_user.user_id', 0);
                }
            }
            $shops = $shops->groupBy('shops.id')->paginate(15)->withQueryString();
            $categories = \VanguardLTE\Category::where(['parent' => 0])->get();
---
select `w_shops`.*, `w_shops`.`id` as `shop_id` from `w_shops` where `w_shops`.`id` in (1) group by `w_shops`.`id` limit 15 offset 0
select * from `w_categories` where (`parent` = 0)

        public function edit($shop)
        {
            $shop = \VanguardLTE\Shop::where('id', $shop)->first();
            if( !$shop )
            {
                abort(404);
            }
            $categories = \VanguardLTE\Category::where(['parent' => 0])->get();
            if( auth()->user()->hasRole([
                'agent',
                'distributor',
                'manager',
                'cashier'
            ]) )
            {
                $ids = \VanguardLTE\ShopUser::where('user_id', auth()->user()->id)->pluck('shop_id')->toArray();
                if( !(count($ids) && in_array($shop->id, $ids)) )
                {
                    abort(404);
                }
            }
            $directories = [];
            foreach( glob(public_path() . '/frontend/*', GLOB_ONLYDIR) as $fileinfo )
            {
                $dirname = basename($fileinfo);
                $directories[$dirname] = $dirname;
            }
            $cats = \VanguardLTE\ShopCategory::where('shop_id', $shop->id)->pluck('category_id')->toArray();
---
select * from `w_shops` where `id` = '1' limit 1
select * from `w_categories` where (`parent` = 0)
select `category_id` from `w_shop_categories` where `shop_id` = 1

            ])->take(2)->get();

            //
            $game_bank = \VanguardLTE\GameBank::where('shop_id', $shop->id)->first();
---
select * from `w_game_bank` where `shop_id` = 1 limit 1